Revit 2027 API
BuiltInFailures.RoofFailures.JoinedRoofMissesTarget Property
 Part of the roof to be joined misses the target face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JoinedRoofMissesTarget { get; }
Public Shared ReadOnly Property JoinedRoofMissesTarget As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JoinedRoofMissesTarget {
	FailureDefinitionId^ get ();
}
static member JoinedRoofMissesTarget : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace